# CopyPasteOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CopyPasteOptions Class
Members See Also
---
Settings to control the behavior of a copy-paste operation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class CopyPasteOptions : IDisposable
```

Visual Basic
---
```text
Public Class CopyPasteOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class CopyPasteOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..CopyPasteOptions
# See Also
CopyPasteOptions Members
Autodesk.Revit.DB Namespace